src/InformationRegisters/Спец_ЛогиПоОбъектам/Спец_ЛогиПоОбъектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Спец_ЛогиПоОбъектам</name>
  <comment>Регистр для хранения логов</comment>
  <resources>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УровеньЛога</name>
    <type>
      <types>EnumRef.Спец_УровниЛогирования</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяПользователяОперационнойСистемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОперативнаяПамять</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Процессор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстИзменений</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТипКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипОперационнойСистемы</name>
    <type>
      <types>EnumRef.Спец_ОперационныеСистемы</types>
    </type>
  </resources>
  <attributes>
    <name>СодержимоеФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>UnixTimestamp</name>
    <type>
      <types>DefinedType.Спец_UnixTimestamp</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Спец_УровниЛогирования/Спец_УровниЛогирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Спец_УровниЛогирования</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/Спец_ЛогиПоОбъектам/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// ++ Спец_БСП.Версия1С_19_Ниже
	Список.Параметры.УстановитьЗначениеПараметра("СмещениеЧасовогоПояса", СмещениеСтандартногоВремени());
	// -- Спец_БСП.Версия1С_19_Ниже
	
	УстановитьУсловноеОформление();
	СоздатьКрасивуюПанельОтборов();
	
	Спец_РаботаСФормами.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Спец_РаботаСФормамиКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ОбработкаСобытияОтбора(Элемент, СтандартнаяОбработка = Истина)
	
	Спец_РаботаСФормамиКлиент.ОбработатьСобытиеОтбора(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Выделение предупреждений
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.УровеньЛога");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.Спец_УровниЛогирования.Предупреждение;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Персиковый);
	
	// Выделение ошибок
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.УровеньЛога");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.Спец_УровниЛогирования.Ошибка;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЛососьСветлый);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКрасивуюПанельОтборов()
	
	СтруктураПараметровПанели = Спец_РаботаСФормами.НоваяСтруктураПараметровВыводаПанелиКрасивыхОтборов(Элементы.Список,
			Элементы.НастройкаСписка,
			Элементы.СписокКомпоновщикНастроекПользовательскиеНастройки);
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ДатаЛога",
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
			"Дата лога",
			Истина,
			Спец_ОбщегоНазначенияКлиентСервер.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"НомерСеанса",
			ВидСравненияКомпоновкиДанных.Равно,
			"НомерСеанса");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"Источник",
			ВидСравненияКомпоновкиДанных.Равно,
			"Источник");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"УровеньЛога",
			ВидСравненияКомпоновкиДанных.Равно,
			"Уровень лога");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ВерсияОС",
			ВидСравненияКомпоновкиДанных.Равно,
			"Версия ОС");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ВерсияПриложения",
			ВидСравненияКомпоновкиДанных.Равно,
			"Версия приложения");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ИмяКомпьютера",
			ВидСравненияКомпоновкиДанных.Равно,
			"Имя компьютера");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ИмяПользователя",
			ВидСравненияКомпоновкиДанных.Равно,
			"Имя пользователя");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ИмяПользователяОперационнойСистемы",
			ВидСравненияКомпоновкиДанных.Равно,
			"Имя пользователя ОС");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"Процессор",
			ВидСравненияКомпоновкиДанных.Равно,
			"Процессор");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ТипКлиента",
			ВидСравненияКомпоновкиДанных.Равно,
			"Тип клиента");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ТипОперационнойСистемы",
			ВидСравненияКомпоновкиДанных.Равно,
			"Тип ОС");
	
	Спец_РаботаСФормами.ВывестиПанельОтборовНаФорму(ЭтотОбъект, СтруктураПараметровПанели);
	
КонецПроцедуры

#КонецОбласти
